In [25]:
import numpy as np
import pandas as pd

In [26]:
data = pd.read_csv('../../data/beauty.csv', sep=';')

In [27]:
np.set_printoptions(precision=2)
pd.set_option('precision', 2)

In [28]:
type(data)

pandas.core.frame.DataFrame

In [29]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [30]:
data.shape

(1260, 10)

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [32]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00
mean,6.31,18.21,0.27,0.93,0.07,0.35,0.69,0.27,12.56,3.19
std,4.66,11.96,0.45,0.25,0.26,0.48,0.46,0.45,2.62,0.68
min,1.02,0.00,0.00,0.00,0.00,0.00,0.00,0.00,5.00,1.00
25%,3.71,8.00,0.00,1.00,0.00,0.00,0.00,0.00,12.00,3.00
50%,5.30,15.00,0.00,1.00,0.00,0.00,1.00,0.00,12.00,3.00
75%,7.70,27.00,1.00,1.00,0.00,1.00,1.00,1.00,13.00,4.00
max,77.72,48.00,1.00,1.00,1.00,1.00,1.00,1.00,17.00,5.00

In [33]:
data['exper'].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

# loc and iloc

In [34]:
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [35]:
data.iloc[:, 2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

In [36]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

In [37]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [49]:
for look, sub_df in data.groupby(['looks', 'female']):
    print(look)

(1, 0)
(1, 1)
(2, 0)
(2, 1)
(3, 0)
(3, 1)
(4, 0)
(4, 1)
(5, 0)
(5, 1)

In [52]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

       wage  exper
looks
1      3.46   32.0
2      4.60   18.0
3      5.63   18.0
4      5.24   12.5
5      4.81    8.0

In [54]:
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

In [55]:
data['wage'].describe()

count    1260.00
mean        6.31
std         4.66
min         1.02
25%         3.71
50%         5.30
75%         7.70
max        77.72
Name: wage, dtype: float64

In [60]:
data['is_rich'] = (data['wage'] > 
                   data['wage'].quantile(.75)).astype('int64')

In [61]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [63]:
data['rubbish'] = .56 * data['wage'] + 0.3 * data['exper']

In [64]:
def string_gender(female):
    return 'female' if female else 'male'

In [67]:
d = {1:'union', 0:'non-union'}

In [68]:
data['union'].map(d).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object

In [65]:
string_gender(0)

'male'

In [66]:
data['female'].apply(lambda female: 'female' if female else 'male')

0       female
1       female
2       female
3         male
4         male
5       female
6         male
7         male
8       female
9       female
10      female
11        male
12        male
13        male
14        male
15        male
16        male
17        male
18      female
19      female
20        male
21        male
22        male
23        male
24        male
25        male
26        male
27        male
28        male
29        male
         ...
1230      male
1231      male
1232      male
1233      male
1234    female
1235      male
1236      male
1237      male
1238      male
1239      male
1240      male
1241      male
1242      male
1243      male
1244      male
1245      male
1246      male
1247      male
1248      male
1249      male
1250      male
1251      male
1252      male
1253    female
1254    female
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object